{
	"page.head.title": "Главная",
	"page.head.meta.description": "Пример i18n в Next.js - Английский",
	"page.header.home": "Главная",
	"page.header.about": "О нас",
	"page.header.switch.lang": "Переключить языка",
	"page.header.switch.theme": "Внешний вид",
	"page.home.title": "Добро пожаловать на <b>домашнюю страницу</b>",
	"page.home.description": "Вы просматриваете домашнюю страницу на русском языке",
	"page.about.title": "Обо мне",
	"page.about.about.me": "Эльхан родился и вырос в небольшом городе Каракол на востоке Кыргызстана. Его родители были простыми людьми, работавшими в местных предприятиях, и всегда поощряли своего сына учиться и развиваться. С самого раннего возраста Эльхан проявлял интерес к компьютерам и технологиям. В 12 лет его родители купили ему первый компьютер, и с тех пор он интересовался программированием. В школе Эльхан был отличником и часто участвовал в олимпиадах по информатике. После окончания школы он решил поступить в университет и более глубоко изучить программирование. В университете Эльхан выбрал специальность \"Программное обеспечение компьютерных систем\", где познакомился с миром разработки фронтенда и полюбил его. Ему нравилось создавать красивые и функциональные веб-сайты, которые пользователи могли использовать для решения своих проблем. После окончания университета Эльхан нашел работу в небольшой веб-студии в Караколе. Он работал там год и получил много опыта создания веб-сайтов для местных бизнесов и организаций. Однажды Эльхан получил предложение о работе от крупной ИТ-компании в Бишкеке, столице Кыргызстана. Это была отличная возможность для него, и он принял предложение. С тех пор Эльхан работает в этой компании и разрабатывает фронтенд для многих веб-приложений и сайтов. Он продолжает изучать новые технологии и улучшать свои навыки, чтобы стать лучшим в своей области. Эльхан очень гордится тем, что он родился и вырос в небольшом городе Каракол и рад тому, что может внести свой вклад в развитие технологий и программирования в своей стране."
}
